---
kind: other
id: Methods.T:Autodesk.Revit.DB.DetailElementOrderUtils
source: html/22535d08-bdfd-30b8-04e0-4313ff8f146a.htm
---
# DetailElementOrderUtils Methods

Indicates if the elements are all detail elements that participate in detail draw ordering in the view.